# -*- coding: utf-8 -*-
'''
********作业要求********
注意python基本代码规范(PEP8规范),
例如变量名只使用小写英文字母、数字和下划线：
link（规范），Link（不规范），data_list（规范），DataList（不规范），...
变量赋值，等号两边加空格:
x = 1
列表和元组的定义，逗号右边加空格:
exmple = [1, 2, 3]
四则运算两边可依个人喜好选择空格或不空格，但代码风格要统一。
'''


'''
ex1. 将下面的字符串string转换为utf编码的字节流，并计算字节流的字节数。输出为一个元组，
     第0个元素为转换后的字节流，第1个元素为字节流长度。
'''
string = '兰州大学数学与统计学院'


'''
ex2. 将下面utf-8编码的的字节流flow转换为字符串，并计算字符串的字符数。输出格式与ex1相似。
'''
flow = b'\xe6\x9c\xb1\xe6\x94\xbf\xe5\x90\x8c\xe5\xad\xa6\xe9\x95\xbf'


'''
ex3. 朱政同学长第一年的GPA是4.2，第二年是5.0，请计算他GPA提高的百分点，
     并格式化输出为'xx.x%'的形式。注意保留一位小数。
'''
g1 = 4.2
g2 = 5.0


'''
ex4. 请用索引取出下面列表l的指定元素.
'''
l = [['LZU', 'THU', 'USTC'],
     ['Python', 'Java', 'C++'],
     ['LHW', 'WUH', 'HGH']]
# 打印LZU
print(???)
# 打印C++
print(???)
# 打印WHU
print(???)
